Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/goormdotcom/prod/runs/run-9z3QvvxSe3Umu7Dn

Waiting for the plan to start...

Terraform v1.5.7
on linux_amd64
Initializing plugins and modules...
module.rds_product.aws_db_parameter_group.this: Refreshing state... [id=product-pg-16]
module.rds_payment.aws_db_parameter_group.this: Refreshing state... [id=payment-pg-16]
module.ecr_user.aws_ecr_repository.this: Refreshing state... [id=goormdotcom/user-service]
module.presigned_s3.aws_iam_user.presigned_user: Refreshing state... [id=presigned-user]
module.ecr_order.aws_ecr_repository.this: Refreshing state... [id=goormdotcom/order-service]
module.ecr_product.aws_ecr_repository.this: Refreshing state... [id=goormdotcom/product-service]
module.rds_order.aws_db_parameter_group.this: Refreshing state... [id=order-pg-16]
module.common_network.aws_vpc.goorm: Refreshing state... [id=vpc-05849d37708e8d04b]
module.rds_user.aws_db_parameter_group.this: Refreshing state... [id=user-pg-16]
module.presigned_s3.aws_s3_bucket.this: Refreshing state... [id=goorm-presigned-bucket]
module.common_network.aws_eip.nat: Refreshing state... [id=eipalloc-05fff92a01c686a25]
module.ecr_payment.aws_ecr_repository.this: Refreshing state... [id=goormdotcom/payment-service]
module.ecr_product.aws_ecr_lifecycle_policy.this: Refreshing state... [id=goormdotcom/product-service]
module.ecr_user.aws_ecr_lifecycle_policy.this: Refreshing state... [id=goormdotcom/user-service]
module.ecr_order.aws_ecr_lifecycle_policy.this: Refreshing state... [id=goormdotcom/order-service]
module.ecr_payment.aws_ecr_lifecycle_policy.this: Refreshing state... [id=goormdotcom/payment-service]
module.ecr_policy_user.data.aws_iam_policy_document.pull: Refreshing...
module.ecr_policy_user.data.aws_iam_policy_document.push: Refreshing...
module.ecr_policy_user.data.aws_iam_policy_document.pull: Refresh complete after 0s [id=3726282990]
module.ecr_policy_user.data.aws_iam_policy_document.push: Refresh complete after 0s [id=1624808761]
module.ecr_policy_user.aws_iam_policy.pull: Refreshing state... [id=arn:aws:iam::277679348474:policy/ecr-pull]
module.ecr_policy_user.aws_iam_policy.push: Refreshing state... [id=arn:aws:iam::277679348474:policy/ecr-push]
module.common_network.aws_internet_gateway.igw: Refreshing state... [id=igw-0e15d27caf5d04488]
module.common_network.aws_subnet.public: Refreshing state... [id=subnet-09ad4d9343cfb64c7]
module.common_network.aws_route_table.public: Refreshing state... [id=rtb-06bc322b3beb2c260]
module.common_network.aws_subnet.private-app: Refreshing state... [id=subnet-039f40894ea2007f2]
module.common_network.aws_route_table.private_db: Refreshing state... [id=rtb-05d66dc5419563992]
module.common_network.aws_subnet.private-db-2: Refreshing state... [id=subnet-0510549f3411c9d6b]
module.common_network.aws_network_acl.private_db: Refreshing state... [id=acl-0c08493f66d453539]
module.common_network.aws_route_table.private_app: Refreshing state... [id=rtb-021321f668dab3076]
module.common_network.aws_network_acl.private_app: Refreshing state... [id=acl-02cbcd2a240674c25]
module.security.aws_security_group.vpc_link: Refreshing state... [id=sg-04a4464be3b0b64d4]
module.common_network.aws_subnet.private-db: Refreshing state... [id=subnet-05a8605bf45055418]
module.targetgroup_payment.aws_lb_target_group.this["tg-payment-1"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:targetgroup/tg-payment-1/e3b3583300f5d98e]
module.targetgroup_payment.aws_lb_target_group.this["tg-payment-2"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:targetgroup/tg-payment-2/405f81a33a3435c6]
module.security.aws_security_group.rds_user: Refreshing state... [id=sg-0c32e1ec713957804]
module.cloudmap.aws_service_discovery_private_dns_namespace.this: Refreshing state... [id=ns-nkj3pddwbuwyf6lo]
module.targetgroup_product.aws_lb_target_group.this["tg-product-1"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:targetgroup/tg-product-1/e43bc2c185041f9b]
module.targetgroup_product.aws_lb_target_group.this["tg-product-2"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:targetgroup/tg-product-2/ee8471d7a37b7031]
module.security.aws_security_group.rds_product: Refreshing state... [id=sg-0f9265b7ebd7016e2]
module.security.aws_security_group.rds_payment: Refreshing state... [id=sg-0613fe7cffbbed089]
module.security.aws_security_group.rds_order: Refreshing state... [id=sg-01500a61cef193bc6]
module.security.aws_security_group.vpce: Refreshing state... [id=sg-0904ffca187c043c9]
module.targetgroup_order.aws_lb_target_group.this["tg-order-1"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:targetgroup/tg-order-1/16e1c1748d8d8679]
module.targetgroup_order.aws_lb_target_group.this["tg-order-2"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:targetgroup/tg-order-2/99a9bcf62ac70f7c]
module.targetgroup_user.aws_lb_target_group.this["tg-user-1"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:targetgroup/tg-user-1/f8159236aae5bc1e]
module.targetgroup_user.aws_lb_target_group.this["tg-user-2"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:targetgroup/tg-user-2/58b11f15cd4e71e3]
module.presigned_s3.data.aws_iam_policy_document.s3_presigned_policy: Refreshing...
module.presigned_s3.data.aws_iam_policy_document.s3_presigned_policy: Refresh complete after 0s [id=2355044183]
module.presigned_s3.aws_s3_bucket_public_access_block.this: Refreshing state... [id=goorm-presigned-bucket]
module.presigned_s3.aws_s3_bucket_versioning.this: Refreshing state... [id=goorm-presigned-bucket]
module.common_network.aws_network_acl_rule.private_db_egress_allow_vpc: Refreshing state... [id=nacl-2621490983]
module.common_network.aws_network_acl_rule.private_db_ingress_allow_vpc: Refreshing state... [id=nacl-4266145329]
module.common_network.aws_network_acl_rule.private_app_ingress_allow_vpc: Refreshing state... [id=nacl-288602567]
module.common_network.aws_network_acl_rule.private_app_egress_allow_vpc: Refreshing state... [id=nacl-853482340]
module.security.aws_security_group.nlb: Refreshing state... [id=sg-0c7ea8dd8c039f161]
module.common_network.aws_route_table_association.private_app_assoc: Refreshing state... [id=rtbassoc-0259d5da3d4635a2b]
module.common_network.aws_nat_gateway.nat: Refreshing state... [id=nat-0de9142c3bd2ab5a8]
module.common_network.aws_network_acl_association.private_app_assoc: Refreshing state... [id=aclassoc-036001ac34e6596a5]
module.common_network.aws_route_table_association.private_db_assoc: Refreshing state... [id=rtbassoc-06401706b781b7a9c]
module.common_network.aws_network_acl_association.private_db_assoc: Refreshing state... [id=aclassoc-0b99aba58abc1609f]
module.common_network.aws_route.public_internet: Refreshing state... [id=r-rtb-06bc322b3beb2c2601080289494]
module.common_network.aws_route_table_association.public_assoc: Refreshing state... [id=rtbassoc-01b60d178019c2bc8]
module.presigned_s3.aws_iam_policy.s3_presigned_policy: Refreshing state... [id=arn:aws:iam::277679348474:policy/s3-presigned-policy]
module.common_network.aws_route.private_app_to_nat: Refreshing state... [id=r-rtb-021321f668dab30761080289494]
module.vpc_endpoint.aws_vpc_endpoint.s3: Refreshing state... [id=vpce-03e8946f7209f7363]
module.nlb.aws_lb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:loadbalancer/net/goorm-nlb/421136e7a7412110]
module.rds_user.aws_db_subnet_group.this: Refreshing state... [id=user-db-subnet-group]
module.rds_order.aws_db_subnet_group.this: Refreshing state... [id=order-db-subnet-group]
module.rds_product.aws_db_subnet_group.this: Refreshing state... [id=product-db-subnet-group]
module.rds_payment.aws_db_subnet_group.this: Refreshing state... [id=payment-db-subnet-group]
module.vpc_endpoint.aws_vpc_endpoint.cloudwatch: Refreshing state... [id=vpce-07a89d9b63915771f]
module.vpc_endpoint.aws_vpc_endpoint.ecr_api: Refreshing state... [id=vpce-080aea06e0b65b3d2]
module.vpc_endpoint.aws_vpc_endpoint.ecr_dkr: Refreshing state... [id=vpce-01f133e3e4b24877c]
module.ecs_cluster.aws_ecs_cluster.this: Refreshing state... [id=arn:aws:ecs:ap-northeast-2:277679348474:cluster/goorm-ecs]
module.presigned_s3.aws_iam_user_policy_attachment.attach: Refreshing state... [id=presigned-user-20251110091756375500000001]
module.rds_user.aws_db_instance.this: Refreshing state... [id=user]
module.rds_product.aws_db_instance.this: Refreshing state... [id=product]
module.nlb.aws_lb_listener.order_1: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:listener/net/goorm-nlb/421136e7a7412110/74618dfe48f86953]
module.nlb.aws_lb_listener.payment_1: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:listener/net/goorm-nlb/421136e7a7412110/4ed8e2bad945e569]
module.nlb.aws_lb_listener.order_2: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:listener/net/goorm-nlb/421136e7a7412110/3d1cec94767a0636]
module.nlb.aws_lb_listener.product_2: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:listener/net/goorm-nlb/421136e7a7412110/51af20e375b22e96]
module.nlb.aws_lb_listener.user_2: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:listener/net/goorm-nlb/421136e7a7412110/a8c67448b2c2a249]
module.nlb.aws_lb_listener.user_1: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:listener/net/goorm-nlb/421136e7a7412110/26212242b297b8c1]
module.nlb.aws_lb_listener.payment_2: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:listener/net/goorm-nlb/421136e7a7412110/ac86689b8519a653]
module.nlb.aws_lb_listener.product_1: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:listener/net/goorm-nlb/421136e7a7412110/365185f97824aca8]
module.rds_order.aws_db_instance.this: Refreshing state... [id=order]
module.rds_payment.aws_db_instance.this: Refreshing state... [id=payment]
module.ecs_cluster.aws_ecs_cluster_capacity_providers.this: Refreshing state... [id=goorm-ecs]
module.presigned_s3.aws_iam_policy.s3_presigned_policy: Drift detected (update)
module.presigned_s3.aws_iam_user.presigned_user: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.apigateway.aws_apigatewayv2_api.order will be created
  + resource "aws_apigatewayv2_api" "order" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "order-api"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags_all                     = (known after apply)
    }

  # module.apigateway.aws_apigatewayv2_api.payment will be created
  + resource "aws_apigatewayv2_api" "payment" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "payment-api"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags_all                     = (known after apply)
    }

  # module.apigateway.aws_apigatewayv2_api.product will be created
  + resource "aws_apigatewayv2_api" "product" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "product-api"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags_all                     = (known after apply)
    }

  # module.apigateway.aws_apigatewayv2_api.user will be created
  + resource "aws_apigatewayv2_api" "user" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "user-api"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags_all                     = (known after apply)
    }

  # module.apigateway.aws_apigatewayv2_authorizer.order_jwt will be created
  + resource "aws_apigatewayv2_authorizer" "order_jwt" {
      + api_id                           = (known after apply)
      + authorizer_result_ttl_in_seconds = (known after apply)
      + authorizer_type                  = "JWT"
      + id                               = (known after apply)
      + identity_sources                 = [
          + "$request.header.Authorization",
        ]
      + name                             = "common-jwt-authorizer"

      + jwt_configuration {
          + audience = [
              + "goormdotcom-aud",
            ]
          + issuer   = "https://public.goorm.store"
        }
    }

  # module.apigateway.aws_apigatewayv2_authorizer.payment_jwt will be created
  + resource "aws_apigatewayv2_authorizer" "payment_jwt" {
      + api_id                           = (known after apply)
      + authorizer_result_ttl_in_seconds = (known after apply)
      + authorizer_type                  = "JWT"
      + id                               = (known after apply)
      + identity_sources                 = [
          + "$request.header.Authorization",
        ]
      + name                             = "common-jwt-authorizer"

      + jwt_configuration {
          + audience = [
              + "goormdotcom-aud",
            ]
          + issuer   = "https://public.goorm.store"
        }
    }

  # module.apigateway.aws_apigatewayv2_authorizer.product_jwt will be created
  + resource "aws_apigatewayv2_authorizer" "product_jwt" {
      + api_id                           = (known after apply)
      + authorizer_result_ttl_in_seconds = (known after apply)
      + authorizer_type                  = "JWT"
      + id                               = (known after apply)
      + identity_sources                 = [
          + "$request.header.Authorization",
        ]
      + name                             = "common-jwt-authorizer"

      + jwt_configuration {
          + audience = [
              + "goormdotcom-aud",
            ]
          + issuer   = "https://public.goorm.store"
        }
    }

  # module.apigateway.aws_apigatewayv2_authorizer.user_jwt will be created
  + resource "aws_apigatewayv2_authorizer" "user_jwt" {
      + api_id                           = (known after apply)
      + authorizer_result_ttl_in_seconds = (known after apply)
      + authorizer_type                  = "JWT"
      + id                               = (known after apply)
      + identity_sources                 = [
          + "$request.header.Authorization",
        ]
      + name                             = "common-jwt-authorizer"

      + jwt_configuration {
          + audience = [
              + "goormdotcom-aud",
            ]
          + issuer   = "https://public.goorm.store"
        }
    }

  # module.apigateway.aws_apigatewayv2_integration.order_1 will be created
  + resource "aws_apigatewayv2_integration" "order_1" {
      + api_id                                    = (known after apply)
      + connection_id                             = (known after apply)
      + connection_type                           = "VPC_LINK"
      + description                               = "Integration for order_1"
      + id                                        = (known after apply)
      + integration_method                        = "ANY"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "HTTP_PROXY"
      + integration_uri                           = "arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:listener/net/goorm-nlb/421136e7a7412110/74618dfe48f86953"
      + payload_format_version                    = "1.0"
      + request_parameters                        = {
          + "overwrite:header.user-id"    = "$context.authorizer.claims.sub"
          + "overwrite:header.user-roles" = "$context.authorizer.claims.role"
        }
      + timeout_milliseconds                      = 29000
    }

  # module.apigateway.aws_apigatewayv2_integration.order_2 will be created
  + resource "aws_apigatewayv2_integration" "order_2" {
      + api_id                                    = (known after apply)
      + connection_id                             = (known after apply)
      + connection_type                           = "VPC_LINK"
      + description                               = "Integration for order_2"
      + id                                        = (known after apply)
      + integration_method                        = "ANY"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "HTTP_PROXY"
      + integration_uri                           = "arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:listener/net/goorm-nlb/421136e7a7412110/3d1cec94767a0636"
      + payload_format_version                    = "1.0"
      + request_parameters                        = {
          + "overwrite:header.user-id"    = "$context.authorizer.claims.sub"
          + "overwrite:header.user-roles" = "$context.authorizer.claims.role"
        }
      + timeout_milliseconds                      = 29000
    }

  # module.apigateway.aws_apigatewayv2_integration.payment_1 will be created
  + resource "aws_apigatewayv2_integration" "payment_1" {
      + api_id                                    = (known after apply)
      + connection_id                             = (known after apply)
      + connection_type                           = "VPC_LINK"
      + description                               = "Integration for payment_1"
      + id                                        = (known after apply)
      + integration_method                        = "ANY"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "HTTP_PROXY"
      + integration_uri                           = "arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:listener/net/goorm-nlb/421136e7a7412110/4ed8e2bad945e569"
      + payload_format_version                    = "1.0"
      + request_parameters                        = {
          + "overwrite:header.user-id"    = "$context.authorizer.claims.sub"
          + "overwrite:header.user-roles" = "$context.authorizer.claims.role"
        }
      + timeout_milliseconds                      = 29000
    }

  # module.apigateway.aws_apigatewayv2_integration.payment_2 will be created
  + resource "aws_apigatewayv2_integration" "payment_2" {
      + api_id                                    = (known after apply)
      + connection_id                             = (known after apply)
      + connection_type                           = "VPC_LINK"
      + description                               = "Integration for payment_2"
      + id                                        = (known after apply)
      + integration_method                        = "ANY"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "HTTP_PROXY"
      + integration_uri                           = "arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:listener/net/goorm-nlb/421136e7a7412110/ac86689b8519a653"
      + payload_format_version                    = "1.0"
      + request_parameters                        = {
          + "overwrite:header.user-id"    = "$context.authorizer.claims.sub"
          + "overwrite:header.user-roles" = "$context.authorizer.claims.role"
        }
      + timeout_milliseconds                      = 29000
    }

  # module.apigateway.aws_apigatewayv2_integration.product_1 will be created
  + resource "aws_apigatewayv2_integration" "product_1" {
      + api_id                                    = (known after apply)
      + connection_id                             = (known after apply)
      + connection_type                           = "VPC_LINK"
      + description                               = "Integration for product_1"
      + id                                        = (known after apply)
      + integration_method                        = "ANY"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "HTTP_PROXY"
      + integration_uri                           = "arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:listener/net/goorm-nlb/421136e7a7412110/365185f97824aca8"
      + payload_format_version                    = "1.0"
      + request_parameters                        = {
          + "overwrite:header.user-id"    = "$context.authorizer.claims.sub"
          + "overwrite:header.user-roles" = "$context.authorizer.claims.role"
        }
      + timeout_milliseconds                      = 29000
    }

  # module.apigateway.aws_apigatewayv2_integration.product_2 will be created
  + resource "aws_apigatewayv2_integration" "product_2" {
      + api_id                                    = (known after apply)
      + connection_id                             = (known after apply)
      + connection_type                           = "VPC_LINK"
      + description                               = "Integration for product_2"
      + id                                        = (known after apply)
      + integration_method                        = "ANY"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "HTTP_PROXY"
      + integration_uri                           = "arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:listener/net/goorm-nlb/421136e7a7412110/51af20e375b22e96"
      + payload_format_version                    = "1.0"
      + request_parameters                        = {
          + "overwrite:header.user-id"    = "$context.authorizer.claims.sub"
          + "overwrite:header.user-roles" = "$context.authorizer.claims.role"
        }
      + timeout_milliseconds                      = 29000
    }

  # module.apigateway.aws_apigatewayv2_integration.user_1 will be created
  + resource "aws_apigatewayv2_integration" "user_1" {
      + api_id                                    = (known after apply)
      + connection_id                             = (known after apply)
      + connection_type                           = "VPC_LINK"
      + description                               = "Integration for user_1"
      + id                                        = (known after apply)
      + integration_method                        = "ANY"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "HTTP_PROXY"
      + integration_uri                           = "arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:listener/net/goorm-nlb/421136e7a7412110/26212242b297b8c1"
      + payload_format_version                    = "1.0"
      + request_parameters                        = {
          + "overwrite:header.user-id"    = "$context.authorizer.claims.sub"
          + "overwrite:header.user-roles" = "$context.authorizer.claims.role"
        }
      + timeout_milliseconds                      = 29000
    }

  # module.apigateway.aws_apigatewayv2_integration.user_2 will be created
  + resource "aws_apigatewayv2_integration" "user_2" {
      + api_id                                    = (known after apply)
      + connection_id                             = (known after apply)
      + connection_type                           = "VPC_LINK"
      + description                               = "Integration for user_2"
      + id                                        = (known after apply)
      + integration_method                        = "ANY"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "HTTP_PROXY"
      + integration_uri                           = "arn:aws:elasticloadbalancing:ap-northeast-2:277679348474:listener/net/goorm-nlb/421136e7a7412110/a8c67448b2c2a249"
      + payload_format_version                    = "1.0"
      + request_parameters                        = {
          + "overwrite:header.user-id"    = "$context.authorizer.claims.sub"
          + "overwrite:header.user-roles" = "$context.authorizer.claims.role"
        }
      + timeout_milliseconds                      = 29000
    }

  # module.apigateway.aws_apigatewayv2_route.order_proxy_blue will be created
  + resource "aws_apigatewayv2_route" "order_proxy_blue" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "JWT"
      + authorizer_id      = (known after apply)
      + id                 = (known after apply)
      + route_key          = "ANY /blue/api/v1/order/{proxy+}"
      + target             = (known after apply)
    }

  # module.apigateway.aws_apigatewayv2_route.order_proxy_green will be created
  + resource "aws_apigatewayv2_route" "order_proxy_green" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "JWT"
      + authorizer_id      = (known after apply)
      + id                 = (known after apply)
      + route_key          = "ANY /green/api/v1/order/{proxy+}"
      + target             = (known after apply)
    }

  # module.apigateway.aws_apigatewayv2_route.payment_proxy_blue will be created
  + resource "aws_apigatewayv2_route" "payment_proxy_blue" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "JWT"
      + authorizer_id      = (known after apply)
      + id                 = (known after apply)
      + route_key          = "ANY /blue/api/v1/payment/{proxy+}"
      + target             = (known after apply)
    }

  # module.apigateway.aws_apigatewayv2_route.payment_proxy_green will be created
  + resource "aws_apigatewayv2_route" "payment_proxy_green" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "JWT"
      + authorizer_id      = (known after apply)
      + id                 = (known after apply)
      + route_key          = "ANY /green/api/v1/payment/{proxy+}"
      + target             = (known after apply)
    }

  # module.apigateway.aws_apigatewayv2_route.product_proxy_blue will be created
  + resource "aws_apigatewayv2_route" "product_proxy_blue" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "JWT"
      + authorizer_id      = (known after apply)
      + id                 = (known after apply)
      + route_key          = "ANY /blue/api/v1/product/{proxy+}"
      + target             = (known after apply)
    }

  # module.apigateway.aws_apigatewayv2_route.product_proxy_green will be created
  + resource "aws_apigatewayv2_route" "product_proxy_green" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "JWT"
      + authorizer_id      = (known after apply)
      + id                 = (known after apply)
      + route_key          = "ANY /green/api/v1/product/{proxy+}"
      + target             = (known after apply)
    }

  # module.apigateway.aws_apigatewayv2_route.user_login_blue will be created
  + resource "aws_apigatewayv2_route" "user_login_blue" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "POST /blue/api/v1/users/login"
      + target             = (known after apply)
    }

  # module.apigateway.aws_apigatewayv2_route.user_login_green will be created
  + resource "aws_apigatewayv2_route" "user_login_green" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "POST /green/api/v1/users/login"
      + target             = (known after apply)
    }

  # module.apigateway.aws_apigatewayv2_route.user_proxy_blue will be created
  + resource "aws_apigatewayv2_route" "user_proxy_blue" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "JWT"
      + authorizer_id      = (known after apply)
      + id                 = (known after apply)
      + route_key          = "ANY /blue/api/v1/users/{proxy+}"
      + target             = (known after apply)
    }

  # module.apigateway.aws_apigatewayv2_route.user_proxy_green will be created
  + resource "aws_apigatewayv2_route" "user_proxy_green" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "JWT"
      + authorizer_id      = (known after apply)
      + id                 = (known after apply)
      + route_key          = "ANY /green/api/v1/users/{proxy+}"
      + target             = (known after apply)
    }

  # module.apigateway.aws_apigatewayv2_route.user_register_blue will be created
  + resource "aws_apigatewayv2_route" "user_register_blue" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "POST /blue/api/v1/users/register"
      + target             = (known after apply)
    }

  # module.apigateway.aws_apigatewayv2_route.user_register_green will be created
  + resource "aws_apigatewayv2_route" "user_register_green" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "POST /green/api/v1/users/register"
      + target             = (known after apply)
    }

  # module.apigateway.aws_apigatewayv2_stage.order_blue will be created
  + resource "aws_apigatewayv2_stage" "order_blue" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "blue"
      + tags_all      = (known after apply)
    }

  # module.apigateway.aws_apigatewayv2_stage.order_green will be created
  + resource "aws_apigatewayv2_stage" "order_green" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "green"
      + tags_all      = (known after apply)
    }

  # module.apigateway.aws_apigatewayv2_stage.payment_blue will be created
  + resource "aws_apigatewayv2_stage" "payment_blue" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "blue"
      + tags_all      = (known after apply)
    }

  # module.apigateway.aws_apigatewayv2_stage.payment_green will be created
  + resource "aws_apigatewayv2_stage" "payment_green" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "green"
      + tags_all      = (known after apply)
    }

  # module.apigateway.aws_apigatewayv2_stage.product_blue will be created
  + resource "aws_apigatewayv2_stage" "product_blue" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "blue"
      + tags_all      = (known after apply)
    }

  # module.apigateway.aws_apigatewayv2_stage.product_green will be created
  + resource "aws_apigatewayv2_stage" "product_green" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "green"
      + tags_all      = (known after apply)
    }

  # module.apigateway.aws_apigatewayv2_stage.user_blue will be created
  + resource "aws_apigatewayv2_stage" "user_blue" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "blue"
      + tags_all      = (known after apply)
    }

  # module.apigateway.aws_apigatewayv2_stage.user_green will be created
  + resource "aws_apigatewayv2_stage" "user_green" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "green"
      + tags_all      = (known after apply)
    }

  # module.apigateway.aws_apigatewayv2_vpc_link.this will be created
  + resource "aws_apigatewayv2_vpc_link" "this" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "goorm-vpc-link"
      + security_group_ids = [
          + "sg-04a4464be3b0b64d4",
        ]
      + subnet_ids         = [
          + "subnet-039f40894ea2007f2",
        ]
      + tags_all           = (known after apply)
    }

Plan: 37 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 5 of 53 estimated
           $318.0399999999998976/mo +$0.0

<!-- Sticky Pull Request Commentterraform-plan -->